package com.fujinbang.setting;

import java.util.Arrays;
import java.util.HashMap;
import java.util.List;

/**
 * Created by Administrator on 2016/6/2.
 */
public class Area {
    private Area() {
    }

    public static List<String> getProvince() {
        List<String> list = Arrays.asList(province);
        return list;
    }

    public static List<String> getCity(String province) {
        return city.get(province);
    }

    private static String[] province = {"黑龙江省", "吉林省", "辽宁省", "﻿辽宁省", "北京市", "天津市", "内蒙古自治区", "河北省", "山东省", "山西省", "河南省", "陕西省", "青海省", "甘肃省", "新疆维吾尔自治区", "宁夏回族自治区", "青海省", "湖南省", "湖北省", "安徽省", "江苏省", "上海市", "江苏省", "浙江省", "福建省", "广东省", "海南省", "重庆市", "广西壮族自治区", "云南省", "四川省", "贵州省"};
    private static HashMap<String, List<String>> city = new HashMap<String, List<String>>() {
        {
            put("黑龙江省", Arrays.asList("哈尔滨", "齐齐哈尔", "黑河", "大庆", "伊春", "鹤岗", "佳木斯", "双鸭山", "七台河", "鸡西", "牡丹江", "绥化", "双城", "尚志", "五常", "阿城", "讷河", "北安", "五大连池", "铁力", "同江", "富锦", "虎林", "密山", "绥芬河", "海林", "宁安", "安达", "肇东", "海伦"));
            put("吉林省", Arrays.asList("长春", "吉林市", "白城", "松原", "四平", "辽源", "通化", "白山", "德惠", "九台", "榆树", "磐石", "蛟河", "桦甸", "舒兰", "洮南", "大安", "双辽", "公主岭", "梅河口", "集安", "临江", "延吉", "图们", "敦化", "珲春", "龙井", "和龙"));
            put("﻿辽宁省", Arrays.asList("沈阳", "大连", "朝阳", "阜新", "铁岭", "抚顺", "本溪", "辽阳", "鞍山", "丹东", "营口", "盘锦", "锦州", "葫芦岛", "新民", "瓦房店", "普兰店", "庄河", "北票", "凌源", "调兵山", "开原", "灯塔", "海城", "凤城", "东港", "大石桥", "盖州", "凌海", "北宁", "兴城"));
            put("北京市", Arrays.asList("东城区", "西城区", "朝阳区", "海淀区", "丰台区", "石景山区", "房山区", "通州区", "顺义区", "昌平区", "平谷区", "怀柔区", "门头沟区", "密云县", "延庆县"));
            put("天津市", Arrays.asList("和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "天津经济技术开发区", "天津港保税区", "天津港，东丽区", "津南区"));
            put("内蒙古自治区", Arrays.asList("呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔", "通辽", "乌兰察布", "鄂尔多斯", "巴彦淖尔", "满洲里", "扎兰屯", "牙克石", "根河", "额尔古纳", "乌兰浩特", "阿尔山", "霍林郭勒", "锡林浩特", "二连浩特", "丰镇"));
            put("河北省", Arrays.asList("石家庄", "邯郸", "唐山", "保定", "秦皇岛", "邢台", "张家口", "承德", "沧州", "廊坊", "衡水", "辛集", "藁城", "晋州", "新乐", "鹿泉", "丰南", "遵化", "迁安", "霸州", "三河", "定州", "涿州", "安国", "高碑店", "泊头", "任丘", "黄骅", "河间", "冀州", "深州", "南宫", "沙河", "武安"));
            put("山东省", Arrays.asList("济南", "青岛", "聊城", "德州", "东营", "淄博", "潍坊", "烟台", "威海", "日照", "临沂", "枣庄", "济宁", "泰安", "莱芜", "滨州", "菏泽", "章丘", "胶州", "胶南", "即墨", "平度", "莱西", "临清", "乐陵", "禹城", "安丘", "昌邑", "高密", "青州", "诸城", "寿光", "栖霞", "海阳", "龙口", "莱阳", "莱州", "蓬莱", "招远", "文登", "荣成", "乳山", "滕州", "曲阜", "兖州", "邹城", "新泰", "肥城"));
            put("山西省", Arrays.asList("太原", "大同", "朔州", "阳泉", "长治", "晋城", "忻州", "吕梁", "晋中", "临汾", "运城", "古交", "潞城", "高平", "原平", "孝义", "汾阳", "介休", "侯马", "霍州", "永济", "河津"));
            put("河南省", Arrays.asList("郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "周口", "驻马店", "信阳", "济源", "荥阳", "新郑", "登封", "新密", "巩义", "邓州", "偃师", "孟州", "沁阳", "卫辉", "辉县", "林州", "永城", "禹州", "长葛", "舞钢", "汝州", "义马", "灵宝", "项城"));
            put("陕西省", Arrays.asList("西安", "延安", "铜川", "渭南", "咸阳", "宝鸡", "汉中", "榆林", "商洛", "安康", "韩城", "华阴", "兴平"));
            put("青海省", Arrays.asList("西宁", "格尔木", "德令哈"));
            put("甘肃省", Arrays.asList("兰州", "嘉峪关", "金昌", "白银", "天水", "酒泉", "张掖", "武威", "庆阳", "平凉", "定西", "陇南", "玉门", "敦煌", "临夏", "合作"));
            put("新疆维吾尔自治区", Arrays.asList("乌鲁木齐", "克拉玛依", "河子", "阿拉尔", "图木舒克", "五家渠", "喀什", "阿克苏", "和田", "吐鲁番", "哈密", "阿图什", "博乐", "昌吉", "阜康", "米泉", "库尔勒", "伊宁", "奎屯", "塔城", "乌苏", "阿勒泰"));
            put("宁夏回族自治区", Arrays.asList("银川", "石嘴山", "吴忠", "中卫", "固原", "灵武", "青铜峡"));
            put("青海省", Arrays.asList("西宁", "格尔木", "德令哈"));
            put("湖南省", Arrays.asList("长沙", "张家界", "常德", "益阳", "岳阳", "株洲", "湘潭", "衡阳", "郴州", "永州", "邵阳", "怀化", "娄底", "浏阳", "津市", "沅江", "汨罗", "临湘", "醴陵", "湘乡", "韶山", "耒阳", "常宁", "资兴", "武冈", "洪江", "冷水江", "涟源", "吉首"));
            put("湖北省", Arrays.asList("武汉", "十堰", "襄樊", "荆门", "孝感", "黄冈", "鄂州", "黄石", "咸宁", "荆州", "宜昌", "随州", "仙桃", "天门", "潜江", "丹江口", "老河口", "枣阳", "宜城", "钟祥", "汉川", "应城", "安陆", "广水", "麻城", "武穴", "大冶", "赤壁", "石首", "洪湖", "松滋", "宜都", "枝江", "当阳", "恩施", "利川"));
            put("安徽省", Arrays.asList("合肥", "宿州", "淮北", "阜阳", "蚌埠", "淮南", "滁州", "马鞍山", "芜湖", "铜陵", "安庆", "黄山", "六安", "巢湖", "池州", "宣城", "亳州", "界首", "明光", "天长", "桐城", "宁国"));
            put("江苏省", Arrays.asList("南京", "徐州", "连云港", "宿迁", "淮安", "盐城", "扬州", "泰州", "南通", "镇江", "常州", "无锡", "苏州", "江阴", "宜兴", "邳州", "新沂", "金坛", "溧阳", "常熟", "张家港", "太仓", "昆山", "吴江", "如皋", "通州", "海门", "启东", "大丰", "东台", "高邮", "仪征", "江都", "扬中", "句容", "丹阳", "兴化", "姜堰", "泰兴", "靖江"));
            put("上海市", Arrays.asList("黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "浦东新区", "松江区", "金山区", "青浦区", "南汇区", "奉贤区", "金山区", "崇明县"));
            put("江苏省", Arrays.asList("南京", "徐州", "连云港", "宿迁", "淮安", "盐城", "扬州", "泰州", "南通", "镇江", "常州", "无锡", "苏州", "江阴", "宜兴", "邳州", "新沂", "金坛", "溧阳", "常熟", "张家港", "太仓", "昆山", "吴江", "如皋", "通州", "海门", "启东", "大丰", "东台", "高邮", "仪征", "江都", "扬中", "句容", "丹阳", "兴化", "姜堰", "泰兴"));
            put("浙江省", Arrays.asList("杭州", "宁波", "湖州", "嘉兴", "舟山", "绍兴", "衢州", "金华", "台州", "温州", "丽水", "临安", "富阳", "建德", "慈溪", "余姚", "奉化", "平湖", "海宁", "桐乡", "诸暨", "上虞", "嵊州", "江山", "兰溪", "永康", "义乌", "东阳", "临海", "温岭", "瑞安", "乐清", "龙泉"));
            put("福建省", Arrays.asList("福州", "厦门市", "泉州", "龙岩", "三明", "莆田", "漳州", "宁德", "长乐", "福清", "福安", "福鼎", "南安", "石狮", "晋江", "龙海", "漳平", "永安", "武夷山", "邵武", "建瓯", "建阳"));
            put("广东省", Arrays.asList("广州", "珠海", "深圳", "东莞", "中山", "江门", "汕头", "汕尾", "佛山", "湛江", "潮州", "茂名", "惠州", "揭阳", "阳江", "肇庆"));
            put("海南省", Arrays.asList("海口", "三亚", "五指山", "琼海", "儋州", "文昌", "万宁", "东方", "定安", "屯昌", "澄迈", "临高", "白沙", "昌江", "乐东", "陵水", "保亭", "琼中"));
            put("重庆市", Arrays.asList("渝中区", "沙坪坝区", "江北区", "南岸区", "九龙坡区", "大渡口区", "巴南区", "渝北区", "北部新区"));
            put("广西壮族自治区", Arrays.asList("南宁", "桂林", "柳州", "梧州", "贵港", "玉林", "钦州", "北海", "防城港", "崇左", "百色", "河池", "来宾", "贺州", "岑溪", "桂平", "北流", "东兴", "凭祥", "宜州", "合山"));
            put("云南省", Arrays.asList("昆明", "玉溪", "曲靖", "丽江", "迪庆", "大理", "个旧", "文山", "西双版纳", "楚雄"));
            put("四川省", Arrays.asList("成都", "广元", "绵阳", "德阳", "南充", "广安", "遂宁", "内江", "乐山", "自贡", "泸州", "宜宾", "攀枝花", "巴中", "达州", "资阳", "眉山", "雅安", "崇州", "邛崃", "都江堰", "彭州", "江油", "什邡", "广汉", "绵竹", "阆中", "华蓥", "峨眉山", "万源", "简阳", "西昌"));
            put("贵州省", Arrays.asList("贵阳", "六盘水", "遵义", "安顺", "清镇", "赤水", "仁怀", "凯里", "都匀", "兴义", "毕节", "铜仁", "福泉"));
        }
    };
}
